In [437]:
import pandas as pd
import numpy as np
import re
from word2number import w2n

In [438]:
df = pd.read_csv('census.csv')
df.head()

,first_name,last_name,address,local_number,salary,employer,member_id,start_date,actively_working
0,Paul,Black,384 Willow St,103,46467,DEF Ltd,1001,2019-03-22,False
1,Alice,Lee,178 Fir St,105,46330,DEF Ltd,1002,2019-01-01,False
2,Victor,Evans,797 Maple St,101,45217,XYZ Inc,1003,2017-08-28,True
3,Mia,Davis,455 Maple St,103,51197,DEF Ltd,1004,2018-01-21,False
4,Frank,Edwards,354 Maple St,105,58269,DEF Ltd,1005,2019-10-29,True

### Duplicates

In [439]:
df['member_id'].drop_duplicates().shape, df['member_id'].shape

((47705,), (50000,))

In [440]:
df[df['member_id'] == 12748]

,first_name,last_name,address,local_number,salary,employer,member_id,start_date,actively_working
11747,Jack,Davis,817 Fir St,105,46206,DEF Ltd,12748,2018-12-12,True
49968,Jane,Mitchell,492 Poplar St,101,fifty thousand,DEF Ltd,12748,2018-06-18,True

In [441]:
df = df.drop_duplicates(subset='member_id', keep='first')

In [442]:
duplicate_df = df[df.duplicated(subset=['member_id'], keep=False)]
duplicate_df.sort_values(by='member_id').head(6)

Empty DataFrame
Columns: [first_name, last_name, address, local_number, salary, employer, member_id, start_date, actively_working]
Index: []

In [443]:
salaries = df[df['salary'] == 'fifty thousand']
salaries.shape

(2359, 9)

In [444]:
df.shape

(47705, 9)

In [445]:
df.dtypes

first_name          object
last_name           object
address             object
local_number         int64
salary              object
employer            object
member_id            int64
start_date          object
actively_working      bool
dtype: object

### Nulls

In [446]:
# All missing values from highest to lowest
df.isnull().sum().sort_values(ascending=False).head(20)

first_name          2496
last_name              0
address                0
local_number           0
salary                 0
employer               0
member_id              0
start_date             0
actively_working       0
dtype: int64

In [447]:
df['first_name'] = df['first_name'].fillna('first_name')

In [448]:
df.isnull().sum().sort_values(ascending=False).head(20)

first_name          0
last_name           0
address             0
local_number        0
salary              0
employer            0
member_id           0
start_date          0
actively_working    0
dtype: int64

In [449]:
df['start_date'] = pd.to_datetime(df['start_date'])

In [450]:
def convert_written_to_number(text):
    try:
        # Check if text is numeric
        if pd.notna(text) and re.match(r'^-?\d+(?:,\d+)?(?:\.\d+)?$', text.strip()):
            return float(text.replace(',', ''))  # Convert numeric text to float

        # Convert written numbers to actual numbers using word2number library
        return w2n.word_to_num(text) if text != 'NaN' else None
    
    except ValueError:
        return text  # Return original text if conversion fails

# Convert mixed numbers and written numbers to actual numbers in 'values' column
df['salary'] = df['salary'].apply(convert_written_to_number)

In [451]:
df.salary.isna().sum()

0

In [452]:
df.salary.dtype

dtype('float64')

In [453]:
df[df['member_id'] == 12748]

,first_name,last_name,address,local_number,salary,employer,member_id,start_date,actively_working
11747,Jack,Davis,817 Fir St,105,46206.0,DEF Ltd,12748,2018-12-12,True

In [454]:
df.set_index('member_id', inplace=True)

In [455]:
df.dtypes

first_name                  object
last_name                   object
address                     object
local_number                 int64
salary                     float64
employer                    object
start_date          datetime64[ns]
actively_working              bool
dtype: object

In [456]:
df.isnull().sum()

first_name          0
last_name           0
address             0
local_number        0
salary              0
employer            0
start_date          0
actively_working    0
dtype: int64

In [457]:
print(df.dtypes)

first_name                  object
last_name                   object
address                     object
local_number                 int64
salary                     float64
employer                    object
start_date          datetime64[ns]
actively_working              bool
dtype: object

In [458]:
df.head()

,first_name,last_name,address,local_number,salary,employer,start_date,actively_working
member_id,,,,,,,,
1001,Paul,Black,384 Willow St,103,46467.0,DEF Ltd,2019-03-22,False
1002,Alice,Lee,178 Fir St,105,46330.0,DEF Ltd,2019-01-01,False
1003,Victor,Evans,797 Maple St,101,45217.0,XYZ Inc,2017-08-28,True
1004,Mia,Davis,455 Maple St,103,51197.0,DEF Ltd,2018-01-21,False
1005,Frank,Edwards,354 Maple St,105,58269.0,DEF Ltd,2019-10-29,True

In [459]:
df.to_csv('cleaned_census.csv', index=True)

In [460]:
df.isnull().sum().sort_values(ascending=False).head(20)

first_name          0
last_name           0
address             0
local_number        0
salary              0
employer            0
start_date          0
actively_working    0
dtype: int64

In [461]:
df2 = pd.read_csv('cleaned_census.csv')
df2.dtypes

member_id             int64
first_name           object
last_name            object
address              object
local_number          int64
salary              float64
employer             object
start_date           object
actively_working       bool
dtype: object

In [462]:
df2.isnull().sum()

member_id           0
first_name          0
last_name           0
address             0
local_number        0
salary              0
employer            0
start_date          0
actively_working    0
dtype: int64

In [464]:
df2[df2['member_id'] == 12748]

,member_id,first_name,last_name,address,local_number,salary,employer,start_date,actively_working
11206,12748,Jack,Davis,817 Fir St,105,46206.0,DEF Ltd,2018-12-12,True